app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
    public function dashboard()
    {
        if (!$this->isLoggedIn()) {
            return redirect()->to('/auth/login'); // Redirect ke halaman login jika belum login
        }

        $session = session();
        $model = new UsersModel();
        $user = $model->where('id', $session->get('id'))->first();