app/Controllers/Auth.php

    public function proseslogin()
    {
        $login = $this->request->getVar('login');
        $password = $this->request->getVar('password');
        $rememberMe = $this->request->getVar('remember_me');

        $session = session();
        $model = new UsersModel();
        $user = $model->where('email', $login)
            ->orWhere('username', $login)
            ->first();

        if ($user && password_verify($password, $user['password'])) {
            if (!$user['is_active']) {
                $session->setFlashdata('error', 'Akun Anda belum diaktifkan. Silakan cek email Anda.');
                return redirect()->back()->withInput();
            }

            $this->setUserSession($user);

            // Set Remember Me token if checked
            if ($rememberMe) {
                $this->setRememberMe($user['id']);
            }

            // Dapatkan IP pengguna dan waktu login
            $ipAddress = $this->request->getIPAddress();
            $loginTime = date('Y-m-d H:i:s');

            // Update IP and Login Time
            $model->update($user['id'], [
                'last_ip' => $ipAddress,
                'last_time' => $loginTime,
            ]);
---
SELECT *
FROM `users`
WHERE `email` = 'syahrulfalahbae@gmail.com'
OR `username` = 'syahrulfalahbae@gmail.com'
 LIMIT 1
UPDATE `users` SET `last_ip` = '118.96.69.215', `last_time` = '2024-08-26 00:58:01', `updated_at` = '2024-08-26 00:58:01'
WHERE `users`.`id` IN ('7')

    public function activate($activationCode)
    {
        $model = new UsersModel();

        $user = $model->where('activation_code', $activationCode)
            ->where('is_active', false)
            ->first();

        if ($user) {
            $model->update($user['id'], ['is_active' => true, 'activation_code' => null]);
---
SELECT *
FROM `users`
WHERE `activation_code` = 'f614fb0aaa3f313fda173f37428d3d02'
AND `is_active` = 0
 LIMIT 1
UPDATE `users` SET `is_active` = 1, `activation_code` = NULL, `updated_at` = '2024-08-26 00:56:48'
WHERE `users`.`id` IN ('7')